type Token = {
    accessToken: string;
    refreshToken: string
}

// طول عمر کوکی مکس ایج بر اساس ثانیه اس نه میلی ثانیه

// ست کوکی یکبار داخل اوث کامپونت صدا زده میشه وقتی کاربر لاگین میکنه
// یکبارم داخل اینترسپتور ریسپانس وقتی اکسس توکن جدید گرفته

export const setCookie = (token: Token) => {
    // این تابع کجا صدا زده میشه توی قسمت چک اوتی پی
    // گاربر کد یکبار مصرف وارد کرد
    // بکند اند بما اکسس توکن و رفرش توکن میده
    // ما این تابع رو داخل فرم هندلرش کال میکنیم و دیتارو بهش پاس میدیم و توی کوکی ست می کنیم
    document.cookie = `accessToken=${token.accessToken}; max-age=86400; path=/`
    document.cookie = `refreshToken=${token.refreshToken}; max-age=${30 * 24 * 60 * 60} path=/`
};

// این تابع کجا صدا زده میشه
// داخل اینترسپتور ریکویست
// ما باهر درخواستی که میزنیم باید بکند مارو بشناسه
// بکند از طریق اکسس توکن میشناسه
// اگه قرار باشه با هر بار درخواست اکسس توکن ست کنیم  توی هدر هارد کد میشه
// پس کاربر وقتی لاگین کرده
// ما اکسس توکن و رفرش توکن رو با ست کوکی ست کردیم داخل کوکی
// 

// میریم داخل اینترسپتو درخواست رو قبل از رسیده به بکند میگیریم
// و با استفاده از این تابع گت کوکی اکسس توکن رو میکیریم
// و داخل هدر درخواست ها اضافه میکنیم
// دیگه نیازی نباشه برای هر ریکویست یک درخواست بزنیم


// یکبارم داخل ریسپانس رفرش توکن رو میگیریم برای گرفتن اکسس جدید در اینترسپتور ریسپانس
// اگر رفرش وجود داره درخواست بزنیم اکسس جدید بگیریم



export  const getCookie = (cookieName: string) => {

    // از کوکی اکسس توکن و رفرش توکن رو  میگیریم تبدیل به ارایه میکنیم
    const arr = document.cookie.split(";");

    // روش فایند میزنیم فاصله بینشون حذف میشه تبدیل به ارایه میشه ایندکس صفر که میشه اسم توکن
    //  ایا برابر با اسم کوکی ورودی تابع است
    // اگه اوکی بود اینجا فایند خود رشته توکن رو میده نه ارایه و کاری به اون اسپلیت نداره شرط تروشده 
    // و از داخل ارایه اون ایتم رو میده که رشته اس
    const arr2 = arr.find((token) => token.trim().split("=")[0] === cookieName);

    // حالا تبدیل به ارایه میشه ایندکس یکش که میشه  مقدار توکن رو ب ما میده
    const token = arr2?.split("=")[1];

    return token;


};
